# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [1]:
import pandas as pd
import numpy as np

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [5]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

data = pd.DataFrame(data)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [6]:
data["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [8]:
data["Salary"] = [50000, 60000, 45000]
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [9]:
data[data["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [13]:
from datetime import datetime
data["Birth year"] = datetime.today().year - data["Age"]
data

    Name  Age         City  Salary  Average age  Birth year
0   John   16     New York   50000         22.0        2008
1  Emily   28  Los Angeles   60000         22.0        1996
2   Ryan   22      Chicago   45000         22.0        2002

### Task 4.2

Add new calculated field `Average age`.

In [14]:
data["Average age"] = data["Age"].mean()
data

    Name  Age         City  Salary  Average age  Birth year
0   John   16     New York   50000         22.0        2008
1  Emily   28  Los Angeles   60000         22.0        1996
2   Ryan   22      Chicago   45000         22.0        2002

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [15]:
abs(data["Age"] - data["Average age"])

0    6.0
1    6.0
2    0.0
dtype: float64

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [16]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

# create DataFrame objects
data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)

In [17]:
# merge
merged_data = pd.merge(data1, data2, on="Name", how="inner")
merged_data

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [18]:
# concatenate
concatenated_data = pd.concat([data1, data2], axis=0, ignore_index=True)
concatenated_data

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
3  Emily   NaN  Los Angeles
4   Ryan   NaN      Chicago
5   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [19]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [22]:
# use + operator here
add = s1 + s2
add

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [23]:
# use - operator here
subtract = s1 - s2
subtract

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [25]:
# use * operator here
multiply = s1 * s2
multiply

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [26]:
# use / operator here
divide = s1 / s2
divide

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [27]:
# use ** operator here
power = s1 ** s2
power

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [28]:
# use // operator here
floor_divide = s1 // s2
floor_divide

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [29]:
# use % operator here
modulus = s1 % s2
modulus

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
# filter s1 here
even_s1 = s1[s1 % 2 == 0]
even_s1

1    2
3    4
dtype: int64

In [31]:
# filter s2 here
odd_s2 = s2[s2 % 2 == 0]
odd_s2

0     6
2     8
4    10
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [45]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [46]:
# make all words in uppercase
s = s.str.upper()
s

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [47]:
# get length of each word
s = s.str.len()
s

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [48]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 11.3 s
Wall time: 12 s

[57.6, 50.2, 48.6, 47.0, 55.6, 49.0, 55.2, 46.8, 44.8, 44.6]

### Solution using Pandas and Numpy

In [49]:
data = pd.Series([random.randint(1, 100) for _ in range(10000000)])
moving_averages = data.rolling(window=5).mean().dropna().head(10)

%time moving_averages

CPU times: total: 0 ns
Wall time: 0 ns

4     36.4
5     46.4
6     42.8
7     39.2
8     29.0
9     40.0
10    44.6
11    47.4
12    56.0
13    60.2
dtype: float64